---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.TextureScaleLock
source: html/075b16aa-21c6-a35c-a9bd-270d67583982.htm
---
# Autodesk.Revit.DB.Visual.Checker.TextureScaleLock Property

The property labeled "Scale Lock" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string TextureScaleLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".